// Задача 6
Console.WriteLine("Введите число");
int numberA = int.Parse(Console.ReadLine () !);
if (numberA % 2 ==0)
{
 Console.WriteLine("Четное число");   
}
else
Console.WriteLine("Нечетное число");