// Задача 2
Console.WriteLine("Введите два числа");
int a = int.Parse(Console.ReadLine () !);
int b = int.Parse(Console.ReadLine () !);
if (a > b)
{
    Console.WriteLine ("Максимальное число - " + a);
}
else
{
  Console.WriteLine ("Максимальное число - " + b);  
}